Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: x stands for dl (delete character under the cursor) X stands for dh (delete character left of the cursor) D stands for d$ (delete to end of the line) C stands for c$ (change to end of the line) s stands for cl (change one character) S stands for cc (change a whole line)
es_es: x equivale a dl (eliminar carácter bajo el cursor) X equivale a dh (eliminar carácter a la izquierda del cursor) D equivale a d$ (eliminar hasta el final de la línea) C equivale a c$ (cambiar hasta el final de la línea) s equivale a cl (cambiar un carácter) S equivale a cc (cambiar una única línea)

source: The commands "3dw" and "d3w" delete three words. If you want to get really picky about things, the first command, "3dw", deletes one word three times; the command "d3w" deletes three words once. This is a difference without a distinction. You can actually put in two counts, however. For example, "3d2w" deletes two words, repeated three times, for a total of six words.
es_es: Las órdenes «3dw» y «d3wx eliminan tres palabras. Si quiere ponerse detallista, la primera ordem, «3dw», elimina una palabra tres veces; la orden «d3w» elimina tres palabras de una vez. Esta diferencia no se puede distinguir. Sin embargo, puede poner dos multiplicadores. Por ejemplo «3d2w» elimina dos palabras y lo repite 3 veces, un total de seis palabras.

source: The "r" command is not an operator. It waits for you to type a character, and will replace the character under the cursor with it. You could do the same with "cl" or with the "s" command, but with "r" you don't have to press <Esc>
es_es: La orden «r» no es un operador. Espera a que introduzca un carácter, y reemplazará el carácter bajo el cursor con él. Puedes hacer lo mismo con la orden «cl» o con «s», pero con «r» no tendrá que pulsar <Esc>

source: there is somerhing grong here ~ rT rt rw
es_es: aquí hay algo tue esná mal ~ rA rq rt

source: There is something wrong here ~
es_es: Aquí hay algo que está mal ~

source: Using a count with "r" causes that many characters to be replaced with the same character. Example:
es_es: Usar un multiplicador con «r» causa que se reemplacen muchos caracteres con el mismo carácter. Por ejemplo:

source: There is something wrong here ~ 5rx
es_es: Aquí hay algo que está mal ~ 5rx

source: There is something xxxxx here ~
es_es: Aquí hay algo que exxxxxal ~

source: To replace a character with a line break use "r<Enter>". This deletes one character and inserts a line break. Using a count here only applies to the number of characters deleted: "4r<Enter>" replaces four characters with one line break.
es_es: Para reemplazar un carácter con un salto de línea use «r<Entrar>». Esto elimina un carácter e inserta un salto. Usar un multiplicador aquí sólo afecta al número de caracteres eliminados: «4r<Entrar>» reemplaza cuatro caracteres con un salto.

source: *04.3* Repeating a change
es_es: *04.3* Repetir un cambio

source: The "." command is one of the most simple yet powerful commands in Vim. It repeats the last change. For instance, suppose you are editing an HTML file and want to delete all the <B> tags. You position the cursor on the first < and delete the <B> with the command "df>". You then go to the < of the next </B> and kill it using the "." command. The "." command executes the last change command (in this case, "df>"). To delete another tag, position the cursor on the < and use the "." command.
es_es: La orden «.» es uno de los más sencillos pero más potentes de Vim. Repite el último cambio. Por ejemplo, suponga que está editando un archivo HTML y desea eliminar todas las etiquetas <B>. Para ello, coloque el cursor sobre el primer < y luego elimine el <B> con la orden «df>». Entonces va al < del </B> y lo elimina con la orden «.». La orden «.» ejecuta el último cambio (en este caso «df>»). Para eliminar otra etiqueta, coloque el cursor sobre el < y vuelve a pulsar la orden «.».

source: To <B>generate</B> a table of <B>contents ~ f< find first < ---> df> delete to > --> f< find next < ---------> . repeat df> ---> f< find next < -------------> . repeat df> -->
es_es: Para <B>generar</B> una tabla de <B>contenidos ~ f< ir al primer < ---> df> elimina hasta > --> f< ir al segundo < ----------> . repetir df> ---> f< ir al siguiente < ------------------> . repetir df> -->

source: Another example: You want to change the word "four" to "five". It appears several times in your text. You can do this quickly with this sequence of commands:
es_es: Otro ejemplo: Desea cambiar la palabra «cuatro» por «cinco». Aparece varias veces en su texto. Puede hacer esto rápidamente en una secuencia de órdenes:

source: /four<Enter> find the first string "four" cwfive<Esc> change the word to "five" n find the next "four" . repeat the change to "five' n find the next "four" . repeat the change etc.
es_es: /cuatro<Entrar> encuentra la primera cadena «cuatro» cwcinco<Esc> cambia la palabra a «cinco» n encuentra la siguiente cadena «cuatro» . repite el cambio a «cinco» n encuentra la siguiente cadena «cuatro» . repite el cambio etc.

source: *04.4* Visual mode
es_es: *04.4* Modo visual

source: To delete simple items the operator-motion changes work quite well. But often it's not so easy to decide which command will move over the text you want to change. Then you can use Visual mode.
es_es: Los cambios operador-movimiento funcionan bastante bien para eliminar elementos sencillos. Pero a menudo, no es fácil decidir que orden de movimiento le desplazará hasta el texto que quiere modificar. Es el momento de usar el modo Visual.

source: You start Visual mode by pressing "v". You move the cursor over the text you want to work on. While you do this, the text is highlighted. Finally type the operator command. For example, to delete from halfway one word to halfway another word:
es_es: Puede iniciar el modo Visual pulsando «v». Puede mover el cursor sobre el texto que desea modificar. Mientras haces esto, el texto se resalta. Finalmente, teclee la orden del operador. Por ejemplo, para eliminar de la mitad de una palabra a la mitad de otra:

source: This is an examination sample of visual mode ~ ----------> velllld
es_es: Esto es una muestra cualquiera del modo Visual ~ ----------> veehhd

source: This is an example of visual mode ~
es_es: Esto es una muestra del modo Visual ~

source: When doing this you don't really have to count how many times you have to press "l" to end up in the right position. You can immediately see what text will be deleted when you press "d".
es_es: Cuando hace esto, no tiene que contar cuántas veces pulsa «e» o «h» para llegar a la posición deseada. Puede verlo de forma inmediata antes de pulsar «d».

source: If you want to work on whole lines, use "V" to start Visual mode. You will see right away that the whole line is highlighted, without moving around. When you move left or right nothing changes. When you move up or down the selection is extended whole lines at a time. For example, select three lines with "Vjj":
es_es: Si quiere trabajar con líneas completas, use «V» para iniciar el modo Visual. Verá que toda la línea se resalta, sin ni siquiera mover el cursor. Cuando mueva el cursor a la izquierda o derecha, nada cambiará. Si lo mueve hacia arriba o hacia abajo, la selección se extenderá a líneas completas. Por ejemplo, seleccione tres líneas con «Vjj»:

source: +------------------------+ | text more text | >> | more text more text | | selected lines >> | text text text | | Vjj >> | text more | V | more text more | +------------------------+
es_es: +------------------------+ | texto más texto | >> | más texto más texto | | líneas seleccionadas >> | texto texto texto | | Vjj >> | texto más | V | más texto más | +------------------------+

source: If you want to work on a rectangular block of characters, use CTRL-V to start Visual mode. This is very useful when working on tables.
es_es: Si desea trabajar en un bloque rectangular de caracteres, use CTRL-V para iniciar el modo Visual. Esto es muy útil si trabaja con tablas.

source: name Q1 Q2 Q3 pierre 123 455 234 john 0 90 39 steve 392 63 334
es_es: nombre Q1 Q2 Q3 pedro 123 455 234 juan 0 90 39 estéban 392 63 334

source: To delete the middle "Q2" column, move the cursor to the "Q" of "Q2". Press CTRL-V to start blockwise Visual mode. Now move the cursor three lines down with "3j" and to the next word with "w". You can see the first character of the last column is included. To exclude it, use "h". Now press "d" and the middle column is gone.
es_es: Para eliminar la columna central «Q2» desplaze el cursor a la «Q» de «Q2». Pulse CTRL-V para iniciar el modo Visual de bloques. Ahora mueva el cursor tres líneas abajo con «3j» y a la siguiente palabra con «w». Puede comprobar que el primer carácter de la última columna se ha incluido. Para excluirlo, use «h». Si ahora pulsa «d» la columna central desaparecerá.

source: If you have selected some text in Visual mode, and discover that you need to change the other end of the selection, use the "o" command (Hint: o for other end). The cursor will go to the other end, and you can move the cursor to change where the selection starts. Pressing "o" again brings you back to the other end.
es_es: Si ha seleccionado algo de texto en modo Visual, y descubre que necesita cambiar el otro lado de la selección, use la orden «o» (Truco: o para el «otro» lado). El cursor irá hasta el otro final de la selección, y podrá modificar dónde comienza la selección. Pulsa «o» de nuevo para volver al otro lado.

source: When using blockwise selection, you have four corners. "o" only takes you to one of the other corners, diagonally. Use "O" to move to the other corner in the same line.
es_es: Cuando usa el modo Visual de bloques, tiene cuatro esquinas. «o» le llevará a una de las otras líneas diagonalmente. Use «O» para moverse hacia el otro final de la misma línea.

source: *04.5* Moving text
es_es: *04.5* Mover texto

source: When you delete something with the "d", "x", or another command, the text is saved. You can paste it back by using the p command. (The Vim name for this is put). Take a look at how this works. First you will delete an entire line, by putting the cursor on the line you want to delete and typing "dd". Now you move the cursor to where you want to put the line and use the "p" (put) command. The line is inserted on the line below the cursor.
es_es: Cuando elimina algo con «d», «x», u otra orden, el texto se guarda. Puede pegarlo usando la orden «p». (El nombre de Vim para esto es «poner», del inglés «put»). Échale un vistazo a cómo funciona esto. Elimine primero una línea completa poniendo el cursor en la línea y pulsando «dd». Mueva ahora el cursor allá donde quiera poner la línea y use la orden «p». La línea se insertará en la línea siguiente a donde se encuentra el cursor.

source: a line a line a line line 2 dd line 3 p line 3 line 3 line 2
es_es: una línea una línea una línea línea 2 dd línea 3 p línea 3 línea 3 línea 2

source: Because you deleted an entire line, the "p" command placed the text line below the cursor. If you delete part of a line (a word, for instance), the "p" command puts it just after the cursor.
es_es: Ya que eliminó una línea completa, la orden «p» colocó la línea de texto debajo del cursor. Si elimina parte de una línea (una palabra, por ejemplo), la orden «px la pone justo después del cursor.

source: The "P" command puts text like "p", but before the cursor. When you deleted a whole line with "dd", "P" will put it back above the cursor. When you deleted a word with "dw", "P" will put it back just before the cursor.
es_es: La orden «P» pone una línea como «p», pero antes del cursor. Cuando elimine una línea con «dd», «P» lo pondrá de vuelta sobre el cursor. Cuando elimine una palabra con «dw», «P» lo pondrá antes del cursor.

source: You can repeat putting as many times as you like. The same text will be used.
es_es: Puede repetir la orden tantas veces como quiera. Se usará el mismo texto.

source: You can use a count with "p" and "P". The text will be repeated as many times as specified with the count. Thus "dd" and then "3p" puts three copies of the same deleted line.
es_es: Puede usar un multiplicador con «p» y «P». El texto se repetirá tantas veces como especifique con el multiplicador. Por ejemplo, usar «dd» y luego «3p» pone tres copias de la misma línea eliminada.

source: Frequently when you are typing, your fingers get ahead of your brain (or the other way around?). The result is a typo such as "teh" for "the". Vim makes it easy to correct such problems. Just put the cursor on the e of "teh" and execute the command "xp". This works as follows: "x" deletes the character e and places it in a register. "p" puts the text after the cursor, which is after the h.
es_es: Más de una vez, mientras teclea, sus dedos irán por delante de su cerebro (¿o al revés?). El resultado es un error del tipo «uqe» en lugar de «que». Vim hace que corregir estos problemas sea sencillo. Simplemente ponga el cursor sobre la «u» de «uqe» y ejecute la orden «xp». Esto funciona del siguiente modo: «x» elimina el carácter «u» y lo coloca en un registro. «p» pone el texto después del cursor, justo después de la «q».

source: teh th the ~ x p
es_es: uqe qe que ~ x p

source: *04.6* Copying text
es_es: *04.6* Copiar texto

source: To copy text from one place to another, you could delete it, use "u" to undo the deletion and then "p" to put it somewhere else. There is an easier way: yanking. The "y" operator copies text into a register. Then a "p" command can be used to put it. Yanking is just a Vim name for copying. The "c" letter was already used for the change operator, and "y" was still available. Calling this operator "yank" made it easier to remember to use the "y" key.
es_es: Para copiar texto de un lugar a otro, puede eliminarlo, usar «u» para deshacer la eliminación y después usar «p» para colocarlo en otro lugar. Hay un modo mejor: «yank» (dar un tirón). El operador «y» copia texto en un registro. Puede usar una orden «p» para ponerlo. «Yanking» es simplemente el nombre de Vim para copiar. La letra «c» ya estaba en uso por el operador «cambiar», y la «y» estaba aún disponible. Llamar a este el operador «yank» hizo que fuera más fácil recordar la «y».

source: Since "y" is an operator, you use "yw" to yank a word. A count is possible as usual. To yank two words use "y2w". Example:
es_es: Ya que «y» es un operador, se usa «yw» para copiar una palabra. Se puede usar un multiplicador. Para copiar dos palabras usa «y2w». Por ejemplo:

source: Notice that "yw" includes the white space after a word. If you don't want this, use "ye".
es_es: Observe que «yw» incluye el espacio en blanco después de la palabra. Si no quiere que esto ocurra, us «ye».

source: The "yy" command yanks a whole line, just like "dd" deletes a whole line. Unexpectedly, while "D" deletes from the cursor to the end of the line, "Y" works like "yy", it yanks the whole line. Watch out for this inconsistency! Use "y$" to yank to the end of the line.
es_es: La orden «yy» copia una sola línea, al igual que «dd» la elimina. Sin embargo, mientras que «D» elimina desde el cursor hasta el final de la línea, «Y» funciona como «yy», copiando la línea completa. ¡Cuidado con esta inconsistencia! Use «y$» para copiar sólo hasta el final.

source: a text line yy a text line a text line line 2 line 2 p line 2 last line last line a text line last line
es_es: línea de texto yy línea de texto línea de texto línea 2 línea 2 p línea 2 última línea última línea línea de texto última línea

source: *04.7* Using the clipboard
es_es: *04.7* Uso del portapapeles

source: If you have copied text to the clipboard in another application, you can paste it in Vim with the Edit/Paste menu. This works in Normal mode and Insert mode. In Visual mode the selected text is replaced with the pasted text.
es_es: Si ha copiado texto en el portapapeles desde otra aplicación, puede pegarlo en Vim con el menú Editar/Pegar. Esto funciona en modo Normal y en modo Insertar. En modo Visual el texto seleccionado es reemplazado.

source: The "Cut" menu item deletes the text before it's put on the clipboard. The "Copy", "Cut" and "Paste" items are also available in the popup menu (only when there is a popup menu, of course). If your Vim has a toolbar, you can also find these items there.
es_es: La opción «Cortar» del menú elimina el texto antes de ponerlo en el portapapeles. Las opciones «Cortar», «Copiar» y «Pegar» están también disponibles en el menú contextual (sólo cuando esté disponible). Si su Vim tiene barra de tareas, puede encontrar estos botones allí también.

source: If you are not using the GUI, or if you don't like using a menu, you have to use another way. You use the normal "y" (yank) and "p" (put) commands, but prepend "* (double-quote star) before it. To copy a line to the clipboard: >
es_es: Si no usa la GUI o no te gusta usar el menú, tiene otro modo. Use la orden «y» normal (copiar) y «p» (poner), pero antes escriba «"*» (comillas dobles, asterisco). Para copiar una línea en el portapapeles: >

source: This only works on versions of Vim that include clipboard support. More about the clipboard in section |09.3| and here: |clipboard|.
es_es: Esto sólo funciona en versiones de Vim que incluyen soporte para portapapeles. Más sobre el portapapeles en la sección |09.3| y aquí: |clipboard|.

source: *04.8* Text objects
es_es: *04.8* Objetos de texto

source: If the cursor is in the middle of a word and you want to delete that word, you need to move back to its start before you can do "dw". There is a simpler way to do this: "daw".
es_es: Si el cursor está en medio de una palabra y la quiere eliminar, tiene que desplazarse hasta su comienzo antes de que pueda hacer «dw». Hay un modo más sencillo de hacer esto: «daw».

source: this is some example text. ~ daw
es_es: esto es texto de ejemplo. ~ daw

source: this is some text. ~
es_es: esto es de ejemplo. ~

source: The "d" of "daw" is the delete operator. "aw" is a text object. Hint: "aw" stands for "A Word". Thus "daw" is "Delete A Word". To be precise, the white space after the word is also deleted (the white space before the word at the end of the line).
es_es: La «d» de «daw» es el operador de eliminación. «aw» es el objeto de texto. Truco: «aw» viene de «A Word». Por lo que «daw» es «Delete A Word». Para ser más precisos, el espacio después de la palabra se elimina también (el espacio antes de la palabra si ésta se encuentra al final de una línea).

source: To change a whole sentence use "cis". Take this text:
es_es: Para cambiar una oración completa use «cis». Suponga este texto:

source: Hello there. This ~ is an example. Just ~ some text. ~
es_es: ¿Qué tal? Esto ~ es un ejemplo. Algo ~ de texto. ~

source: Move to the start of the second line, on "is an". Now use "cis":
es_es: Vaya al comienzo de la segunda línea, sobre el «es un». Ahora, use «cis»:

source: Hello there. Just ~ some text. ~
es_es: ¿Qué tal? Algo ~ de texto. ~

source: The cursor is in between the blanks in the first line. Now you type the new sentence "Another line.":
es_es: El cursor está entre los espacios de la primera línea. Escriba ahora la nueva frase «Otra línea.»:

source: Hello there. Another line. Just ~ some text. ~
es_es: ¿Qué tal? Otra línea. Algo ~ de texto. ~

source: "cis" consists of the "c" (change) operator and the "is" text object. This stands for "Inner Sentence". There is also the "as" (a sentence) object. The difference is that "as" includes the white space after the sentence and "is" doesn't. If you would delete a sentence, you want to delete the white space at the same time, thus use "das". If you want to type new text the white space can remain, thus you use "cis".
es_es: «cis» consiste del operador «c» (cambiar) y el objeto de texto «is». Esto viene de «Inner Sentence». También hay un objeto «as» (a sentence). La diferencia es que «as» incluye el espacio en blanco después de la frase e «is» no. Si desea eliminar la frase y quiere eliminar al mismo tiempo el espacio en blanco posterior, use entonces «das». Si quiere escribir otro texto, el espacio puede permanecer, con lo que puedes usar «cis».

source: You can also use text objects in Visual mode. It will include the text object in the Visual selection. Visual mode continues, thus you can do this several times. For example, start Visual mode with "v" and select a sentence with "as". Now you can repeat "as" to include more sentences. Finally you use an operator to do something with the selected sentences.
es_es: También puede usar los objetos de texto on modo Visual. Incluirá el objeto de texto en la selección. El modo Visual permanece, así que puede hacerlo varias veces. Por ejemplo, inicie el modo Visual con «v» y seleccione una frase con «as». Ahora puede repetir «as» para incluir más frases. Por último, use un operador para hacer algo con las frases seleccionadas.

source: *04.9* Replace mode
es_es: *04.9* Modo reemplazar

source: The "R" command causes Vim to enter replace mode. In this mode, each character you type replaces the one under the cursor. This continues until you type <Esc>. In this example you start Replace mode on the first "t" of "text":
es_es: La orden «R» hace que Vim entre en modo reemplazar. En este modo, cada carácter que introduzca reemplaza al que está debajo del cursor. Esto continúa hasta que pulse <Esc>. En este ejemplo, Ud. comienza el modo Reemplazar en la primera «t» de «texto»:

source: This is text. ~ Rinteresting.<Esc>
es_es: Esto es texto. ~ Rinteresante.<Esc>

source: This is interesting. ~
es_es: Esto es interesante. ~

source: You may have noticed that this command replaced 5 characters in the line with twelve others. The "R" command automatically extends the line if it runs out of characters to replace. It will not continue on the next line.
es_es: Puede que haya notado que ha reemplazado 5 caracteres en la línea con otros doce. La orden «R» extiende automáticamente la línea si se queda sin caracteres que reemplazar. Esto no ocurrirá en la siguiente línea.

source: When you use <BS> (backspace) to make correction, you will notice that the old text is put back. Thus it works like an undo command for the last typed character.
es_es: Cuando use <Retroceso> para hacer una corrección comprobará que el texto anterior reaparece. Por lo tanto, funciona como la orden deshacer para el último carácter tecleado.

source: *04.10* Conclusion
es_es: *04.10* Conclusión

source: The operators, movement commands and text objects give you the possibility to make lots of combinations. Now that you know how it works, you can use N operators with M movement commands to make N * M commands!
es_es: Los operadores, órdenes de movimiento y los objetos de texto le dan múltiples posibilidades para hacer muchas combinaciones. Ahora que sabe cómo funciona, puede usar N operadores con M órdenes de movimiento para hacer M * N órdenes!

source: For example, there are many other ways to delete pieces of text. Here are a few often used ones:
es_es: Por ejemplo, hay otras muchas maneras de eliminar porciones de texto. Aquí tiene algunas de las más empleadas:
